In [1]:
import sqlite3
db = sqlite3.connect('my_database1.db')
db.execute('drop table if exists grade1')
db.execute("create table grade1(id int, name txt, score int)")
db.execute("insert into grade1(id,name,score) values(1,'John', 99)")
db.execute("insert into grade1(id,name,score) values(2,'Ayon', 90)")
db.execute("insert into grade1(id,name,score) values(3,'Lima', 89)")
db.execute("insert into grade1(id,name,score) values(4,'Prazel', 100)")
db.execute("insert into grade1(id,name,score) values(5,'Jason', 80)")

In [2]:
db.commit()

In [3]:
results = db.execute("select * from grade1 order by id")

In [4]:
for row in results:
    print(row)

(1, 'John', 99)
(2, 'Ayon', 90)
(3, 'Lima', 89)
(4, 'Prazel', 100)
(5, 'Jason', 80)

or below as printing into a list

In [5]:
results = db.execute("select * from grade1 order by id")
list(results)

[(1, 'John', 99),
 (2, 'Ayon', 90),
 (3, 'Lima', 89),
 (4, 'Prazel', 100),
 (5, 'Jason', 80)]

In [6]:
results = db.execute("select * from grade1 order by score")
for row in results:
    print(row)

(5, 'Jason', 80)
(3, 'Lima', 89)
(2, 'Ayon', 90)
(1, 'John', 99)
(4, 'Prazel', 100)

order by score descending order

In [7]:
results = db.execute("select * from grade1 order by score desc")
for row in results:
    print(row)

(4, 'Prazel', 100)
(1, 'John', 99)
(2, 'Ayon', 90)
(3, 'Lima', 89)
(5, 'Jason', 80)

In [8]:
results = db.execute("select * from grade1 where name =='Ayon'")
for row in results:
    print(row)

(2, 'Ayon', 90)

In [9]:
results = db.execute("select * from grade1 where score>=89")
for row in results:
    print(row)

(1, 'John', 99)
(2, 'Ayon', 90)
(3, 'Lima', 89)
(4, 'Prazel', 100)

In [10]:
results = db.execute("select name, score from grade1 order by score asc")
for row in results:
    print(row)

('Jason', 80)
('Lima', 89)
('Ayon', 90)
('John', 99)
('Prazel', 100)

printing each row in list format instead of tuple - typecasting it as list

In [11]:
results = db.execute("select name, score from grade1 order by score asc")
for row in results:
    print(list(row))

['Jason', 80]
['Lima', 89]
['Ayon', 90]
['John', 99]
['Prazel', 100]

Another way for database connectivity

In [31]:
import sqlite3
db = sqlite3.connect('my_database2.db')
db.execute('drop table if exists test')
query = """CREATE TABLE test(a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER);"""
db.execute(query)

In [32]:
data = [('Atlanta','Georgia',1.25, 6),
        ('Albany','NewYork',2.6,4),
        ('Sacremento','California',5.4,8)]
smt = "INSERT INTO test VALUES(?,?,?,?)"

In [33]:
db.executemany(smt,data)
db.commit()

In [34]:
cursor = db.execute('SELECT * FROM test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Albany', 'NewYork', 2.6, 4),
 ('Sacremento', 'California', 5.4, 8)]